app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

  def show
    @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @appointment = Appointment.new(params[:appointment])
    @appointment.scheduled_date = DateTime.parse(@appointment.scheduled_time.to_s).to_date

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("arrival_status", "arrived", "created_at", "left", "patient_id", "scheduled_date", "scheduled_time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)