app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"

  def show
    @patient = Patient.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @patient = Patient.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("arrival_status", "arrival_time", "arrived", "copay_paid", "created_at", "insurance_verified", "language", "name", "physician", "registered", "scheduled_time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "patients" SET "arrived" = 't', "arrival_time" = '2013-10-07 17:30:49.000000', "arrival_status" = -1170.8166666666666, "updated_at" = '2013-10-07 17:31:09.749372' WHERE "patients"."id" = 1